export interface StepNode {
  options: string[];
  next?: { [key: string]: StepNode };
  finalOptions?: string[];
}

const tree: StepNode = {
  "options": [
    "국물",
    "안국물안국물"
  ],
  "next": {
    "국물": {
      "options": [
        "밥",
        "면"
      ],
      "next": {
        "밥": {
          "options": [
            "탕",
            "찌개"
          ],
          "next": {
            "탕": {
              "options": [],
              "finalOptions": [
                "갈비탕",
                "양평해장국",
                "돼지국밥",
                "순대국",
                "감자탕",
                "콩나물국밥",
                "소고기국밥",
                "육개장",
                "곰탕",
                "설렁탕",
                "도가니탕",
                "추어탕",
                "동태탕",
                "복국",
                "삼계탕",
                "닭곰탕",
                "만둣국",
                "닭한마리",
                "닭볶음탕",
                "알탕",
                "매운탕",
                "북어국",
                "닭개장",
                "쇠고기미역국",
                "우거지탕",
              ]
            },
            "찌개": {
              "options": [],
              "finalOptions": [
                "된장찌개",
                "청국장",
                "부대찌개",
                "순두부찌개",
                "짜글이",
                "비지찌개",
                "고추장찌개",
                '동태찌개',
                '생태찌개',
                "애호박찌개"
              ]
            }
          }
        },
        "면": {
          "options": [
            "차가운 면",
            "따뜻한 면"
          ],
          "next": {
            "차가운 면": {
              "options": [],
              "finalOptions": [
                "물냉면",
                "물밀면",
                "물막국수",
                "냉소바",
                "콩국수",
                "초계국수",
                "냉짬뽕",
                "비빔냉면",
                "비빔밀면",
                "비빔막국수",
                "냉우동",
                "열무국수",
              ]
            },
            "따뜻한 면": {
              "options": [],
              "finalOptions": [
                "우동",
                "잔치국수",
                "칼국수",
                "짬뽕",
                "일본식라멘",
                "라볶이",
                "즉석떡볶이",
              ]
            }
          }
        }
      }
    },
    "안국물": {
      "options": [
        "탄수화물",
        "고기류"
      ],
      "next": {
        "탄수화물": {
          "options": [
            "쌀",
            "밀가루"
          ],
          "next": {
            "쌀": {
              "options": [],
              "finalOptions": [
                "카레",
                "오므라이스",
                "제육덮밥",
                "비빔밥",
                "김치볶음밥",
                "치킨마요덮밥",
                "규동",
                "새우볶음밥",
                "스테이크덮밥",
                "차슈덮밥",
                "소불고기덮밥",
                "연어덮밥",
                "버터간장밥",
                "마파두부덮밥",
                "김밥"
              ]
            },
            "밀가루": {
              "options": [],
              "finalOptions": [
                "토마토파스타",
                "알리오올리오",
                "까르보나라",
                "팟타이",
                "짜장면",
                "비빔국수",
                "쫄면",
                "야끼우동",
                "떡볶이",
                "햄버거",
                "피자",
                "핫도그",
                "토스트",
              ]
            }
          }
        },
        "고기류": {
          "options": [
            "붉은 고기",
            "흰 고기"
          ],
          "next": {
            "붉은 고기": {
              "options": [],
              "finalOptions": [
                "삼겹살",
                "돈까스",
                "돼지불백",
                "제육볶음",
                "LA갈비",
                "양꼬치",
                "갈비찜",
                "돼지갈비",
                "보쌈",
                "족발",
                "육회",
                "떡갈비"
              ]
            },
            "흰 고기": {
              "options": [],
              "finalOptions": [
                "닭갈비",
                "훈제오리",
                "후라이드치킨",
                "양념치킨",
                "치킨까스",
                "닭강정",
                "생선구이",
                "간장게장",
                "양념게장",
                "아구찜",
                "낙곱새",
              ]
            }
          }
        }
      }
    }
  }
};

export default tree;